In [2]:
import pandas as pd

In [3]:
dt=pd.read_csv("pandas_question.csv")

In [4]:
dt.head(5)

      Name  Gender  Age  Height (cm)  Weight (kg)         City
0    Alice  Female   25          165           58     New York
1      Bob    Male   30          180           80  Los Angeles
2  Charlie    Male   35          175           70      Chicago
3    Diana  Female   28          170           65        Miami
4      Eva  Female   27          175           60     New York

In [5]:
dt.shape

(10, 6)

In [6]:
dt.isnull().sum()

Name           0
Gender         0
Age            0
Height (cm)    0
Weight (kg)    0
City           0
dtype: int64

In [7]:
avg_age=dt['Age'].mean()
avg_h=dt['Height (cm)'].mean()
avg_w=dt['Weight (kg)'].mean()
print(avg_age)
print(avg_h)
print(avg_w)

31.6
175.0
68.9

In [8]:
print(dt[dt['Height (cm)'] == dt['Height (cm)'].max()]['Name'].values[0])
print(dt[dt['Height (cm)'] == dt['Height (cm)'].max()]['City'].values[0])

Frank
Houston

In [9]:
dt['BMI'] = dt['Weight (kg)'] / dt['Height (cm)'] **2
print(dt)

      Name  Gender  Age  Height (cm)  Weight (kg)         City       BMI
0    Alice  Female   25          165           58     New York  0.002130
1      Bob    Male   30          180           80  Los Angeles  0.002469
2  Charlie    Male   35          175           70      Chicago  0.002286
3    Diana  Female   28          170           65        Miami  0.002249
4      Eva  Female   27          175           60     New York  0.001959
5    Frank    Male   40          190           85      Houston  0.002355
6    Grace  Female   32          168           55      Chicago  0.001949
7    Henry    Male   45          175           75  Los Angeles  0.002449
8      Ivy  Female   26          172           63        Miami  0.002130
9     Jack    Male   28          180           78     New York  0.002407

In [12]:
group=dt.groupby('Gender')
avg=group[['Age','Height (cm)','Weight (kg)']].mean()
print("Females:")
print(avg.loc['Female'])
print("Males:")
print(avg.loc['Male'])

Females:
Age             27.6
Height (cm)    170.0
Weight (kg)     60.2
Name: Female, dtype: float64
Males:
Age             35.6
Height (cm)    180.0
Weight (kg)     77.6
Name: Male, dtype: float64

In [14]:
sort=dt.sort_values(by='Age',ascending=True)
print(sort.head(3))

    Name  Gender  Age  Height (cm)  Weight (kg)      City       BMI
0  Alice  Female   25          165           58  New York  0.002130
8    Ivy  Female   26          172           63     Miami  0.002130
4    Eva  Female   27          175           60  New York  0.001959

In [15]:
people=dt[dt['City']=='New York']
print(people)

    Name  Gender  Age  Height (cm)  Weight (kg)      City       BMI
0  Alice  Female   25          165           58  New York  0.002130
4    Eva  Female   27          175           60  New York  0.001959
9   Jack    Male   28          180           78  New York  0.002407